<a href="https://colab.research.google.com/github/PRihana/Machine-learning/blob/master/30_3_2020(ML)StudentsPerformance.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd
import numpy as np

In [7]:
# numpy version check
print(np.__version__)
# Pandas version
print(pd.__version__)

1.18.2
0.25.3

In [6]:
# Read the data
data = pd.read_csv("/content/StudentsPerformance.csv")
data

     gender race/ethnicity  ... reading score writing score
0    female        group B  ...            72            74
1    female        group C  ...            90            88
2    female        group B  ...            95            93
3      male        group A  ...            57            44
4      male        group C  ...            78            75
..      ...            ...  ...           ...           ...
995  female        group E  ...            99            95
996    male        group C  ...            55            55
997  female        group C  ...            71            65
998  female        group D  ...            78            77
999  female        group D  ...            86            86

[1000 rows x 8 columns]

In [8]:
data.head()

   gender race/ethnicity  ... reading score writing score
0  female        group B  ...            72            74
1  female        group C  ...            90            88
2  female        group B  ...            95            93
3    male        group A  ...            57            44
4    male        group C  ...            78            75

[5 rows x 8 columns]

In [10]:
# Checking output type
print(type(data))

<class 'pandas.core.frame.DataFrame'>

In [11]:
# To check the shape 
print(data.shape)
# to get the number of rows 
print(data.shape[0])
# to get the number of columns 
print(data.shape[1])

(1000, 8)
1000
8

In [12]:
# To get the column names
print(data.columns)
# To get the row names
print(data.index)

Index(['gender', 'race/ethnicity', 'parental level of education', 'lunch',
       'test preparation course', 'math score', 'reading score',
       'writing score'],
      dtype='object')
RangeIndex(start=0, stop=1000, step=1)

In [13]:
# Datatype of each column
print(data.dtypes)
print("-----"*15)
# what is output type for data.dtypes
print(type(data.dtypes))
print("-----"*15)
# Access the first column dtype
print(data.dtypes[0])
print("-----"*15)
# Access the last column dtype
print(data.dtypes[-1])

gender                         object
race/ethnicity                 object
parental level of education    object
lunch                          object
test preparation course        object
math score                      int64
reading score                   int64
writing score                   int64
dtype: object
---------------------------------------------------------------------------
<class 'pandas.core.series.Series'>
---------------------------------------------------------------------------
object
---------------------------------------------------------------------------
int64

In [14]:
# Column count for each datatype
# How many columns are there with int64
# How many columns are there with float64
# How many columns are there with object
data.dtypes.value_counts()
# Note We are using series method value_counts

object    5
int64     3
dtype: int64

In [15]:
# display top 5 rows
data.head()

   gender race/ethnicity  ... reading score writing score
0  female        group B  ...            72            74
1  female        group C  ...            90            88
2  female        group B  ...            95            93
3    male        group A  ...            57            44
4    male        group C  ...            78            75

[5 rows x 8 columns]

In [16]:
# display top 10 rows
data.head(10)

   gender race/ethnicity  ... reading score writing score
0  female        group B  ...            72            74
1  female        group C  ...            90            88
2  female        group B  ...            95            93
3    male        group A  ...            57            44
4    male        group C  ...            78            75
5  female        group B  ...            83            78
6  female        group B  ...            95            92
7    male        group B  ...            43            39
8    male        group D  ...            64            67
9  female        group B  ...            60            50

[10 rows x 8 columns]

In [17]:
# display last 5 rows
data.tail()

     gender race/ethnicity  ... reading score writing score
995  female        group E  ...            99            95
996    male        group C  ...            55            55
997  female        group C  ...            71            65
998  female        group D  ...            78            77
999  female        group D  ...            86            86

[5 rows x 8 columns]

In [18]:
# display last 3 rows
data.tail(3)

     gender race/ethnicity  ... reading score writing score
997  female        group C  ...            71            65
998  female        group D  ...            78            77
999  female        group D  ...            86            86

[3 rows x 8 columns]

In [19]:
# select a random row
data.sample()

     gender race/ethnicity  ... reading score writing score
886  female        group E  ...           100            95

[1 rows x 8 columns]

In [20]:
# select 5 rows randomly
data.sample(5)

     gender race/ethnicity  ... reading score writing score
820  female        group A  ...            90            92
439    male        group D  ...            88            82
694  female        group C  ...            63            56
401    male        group A  ...            43            43
729    male        group C  ...            39            37

[5 rows x 8 columns]

In [21]:
data.head(1)

   gender race/ethnicity  ... reading score writing score
0  female        group B  ...            72            74

[1 rows x 8 columns]

In [22]:
data.tail(1)

     gender race/ethnicity  ... reading score writing score
999  female        group D  ...            86            86

[1 rows x 8 columns]

In [23]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
gender                         1000 non-null object
race/ethnicity                 1000 non-null object
parental level of education    1000 non-null object
lunch                          1000 non-null object
test preparation course        1000 non-null object
math score                     1000 non-null int64
reading score                  1000 non-null int64
writing score                  1000 non-null int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

In [24]:
type(data.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
gender                         1000 non-null object
race/ethnicity                 1000 non-null object
parental level of education    1000 non-null object
lunch                          1000 non-null object
test preparation course        1000 non-null object
math score                     1000 non-null int64
reading score                  1000 non-null int64
writing score                  1000 non-null int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

NoneType

In [26]:
# To access the column gender
data.gender

0      female
1      female
2      female
3        male
4        male
        ...
995    female
996      male
997    female
998    female
999    female
Name: gender, Length: 1000, dtype: object

In [27]:
# What is the ouput type
print(type(data.gender))

<class 'pandas.core.series.Series'>

In [30]:
#specific column Datatype
data.lunch

0          standard
1          standard
2          standard
3      free/reduced
4          standard
           ...
995        standard
996    free/reduced
997    free/reduced
998        standard
999    free/reduced
Name: lunch, Length: 1000, dtype: object

ERROR! Session/line number was not unique in database. History logging moved to new session 62

In [31]:
# Specific column datatype
data.lunch.dtype

dtype('O')

In [33]:
data.dtypes

gender                         object
race/ethnicity                 object
parental level of education    object
lunch                          object
test preparation course        object
math score                      int64
reading score                   int64
writing score                   int64
dtype: object

In [41]:
# To get the description for the numerical columns
data.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

In [45]:
data.count()

gender                         1000
race/ethnicity                 1000
parental level of education    1000
lunch                          1000
test preparation course        1000
math score                     1000
reading score                  1000
writing score                  1000
dtype: int64

In [46]:
# To get the list of numerical columns
data.describe().columns

Index(['math score', 'reading score', 'writing score'], dtype='object')

In [47]:
# To get the description for the categorical columns
data.describe(include=object)

        gender race/ethnicity  ...     lunch test preparation course
count     1000           1000  ...      1000                    1000
unique       2              5  ...         2                       2
top     female        group C  ...  standard                    none
freq       518            319  ...       645                     642

[4 rows x 5 columns]

In [48]:
data.describe(include=np.int64)

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

In [51]:
data.describe(include='all')

        gender race/ethnicity  ... reading score writing score
count     1000           1000  ...   1000.000000   1000.000000
unique       2              5  ...           NaN           NaN
top     female        group C  ...           NaN           NaN
freq       518            319  ...           NaN           NaN
mean       NaN            NaN  ...     69.169000     68.054000
std        NaN            NaN  ...     14.600192     15.195657
min        NaN            NaN  ...     17.000000     10.000000
25%        NaN            NaN  ...     59.000000     57.750000
50%        NaN            NaN  ...     70.000000     69.000000
75%        NaN            NaN  ...     79.000000     79.000000
max        NaN            NaN  ...    100.000000    100.000000

[11 rows x 8 columns]

In [52]:
data.columns

Index(['gender', 'race/ethnicity', 'parental level of education', 'lunch',
       'test preparation course', 'math score', 'reading score',
       'writing score'],
      dtype='object')

In [53]:
data.iloc[1,:] # row with index 1 and all the columns

gender                               female
race/ethnicity                      group C
parental level of education    some college
lunch                              standard
test preparation course           completed
math score                               69
reading score                            90
writing score                            88
Name: 1, dtype: object

In [54]:
data.loc[1,:]

gender                               female
race/ethnicity                      group C
parental level of education    some college
lunch                              standard
test preparation course           completed
math score                               69
reading score                            90
writing score                            88
Name: 1, dtype: object

In [55]:
data.iloc[1,1] # row with index 1and column with index 1

'group C'

In [56]:
data.loc[1,"race/ethnicity"]

'group C'

In [57]:
data.iloc[1,1:3] # row with index 1 and columns with index 1,2
# iloc stop index is exclusive

race/ethnicity                      group C
parental level of education    some college
Name: 1, dtype: object

In [60]:
data.loc[1,"race/ethnicity":"parental level of education"] 
# loc - the stop label also inclusive

race/ethnicity                      group C
parental level of education    some college
Name: 1, dtype: object

In [59]:
data.iloc[1:4,1:3] 
# rows with indices 1,2,3
# columns with indices 1,2

  race/ethnicity parental level of education
1        group C                some college
2        group B             master's degree
3        group A          associate's degree

In [61]:
data.loc[1:3,"race/ethnicity":"parental level of education"]

  race/ethnicity parental level of education
1        group C                some college
2        group B             master's degree
3        group A          associate's degree

In [62]:
data.gender.nunique()

2

In [104]:
data.set_index("math score")

            gender race/ethnicity  ... reading score writing score
math score                         ...
72          female        group B  ...            72            74
69          female        group C  ...            90            88
90          female        group B  ...            95            93
47            male        group A  ...            57            44
76            male        group C  ...            78            75
...            ...            ...  ...           ...           ...
88          female        group E  ...            99            95
62            male        group C  ...            55            55
59          female        group C  ...            71            65
68          female        group D  ...            78            77
77          female        group D  ...            86            86

[1000 rows x 7 columns]

In [105]:
data

     gender race/ethnicity  ... reading score writing score
0    female        group B  ...            72            74
1    female        group C  ...            90            88
2    female        group B  ...            95            93
3      male        group A  ...            57            44
4      male        group C  ...            78            75
..      ...            ...  ...           ...           ...
995  female        group E  ...            99            95
996    male        group C  ...            55            55
997  female        group C  ...            71            65
998  female        group D  ...            78            77
999  female        group D  ...            86            86

[1000 rows x 8 columns]

In [114]:
df = data.set_index("math score")
df.head()

            gender race/ethnicity  ... reading score writing score
math score                         ...
72          female        group B  ...            72            74
69          female        group C  ...            90            88
90          female        group B  ...            95            93
47            male        group A  ...            57            44
76            male        group C  ...            78            75

[5 rows x 7 columns]

In [115]:
df.index

Int64Index([72, 69, 90, 47, 76, 71, 88, 40, 64, 38,
            ...
            86, 65, 55, 62, 63, 88, 62, 59, 68, 77],
           dtype='int64', name='math score', length=1000)

In [116]:
# row with index 1 and all the columns
df.iloc[1,:]

gender                               female
race/ethnicity                      group C
parental level of education    some college
lunch                              standard
test preparation course           completed
reading score                            90
writing score                            88
Name: 69, dtype: object

In [117]:
df.loc[28,:]

gender                                 male
race/ethnicity                      group A
parental level of education    some college
lunch                          free/reduced
test preparation course                none
reading score                            23
writing score                            19
Name: 28, dtype: object

In [118]:
# row with index 1and column with index 1
df.iloc[1,1]

'group C'

In [119]:
# row with index 1 and columns with index 1,2
df.iloc[1,1:3]

race/ethnicity                      group C
parental level of education    some college
Name: 69, dtype: object

In [120]:
df.loc[ 88,"test preparation course":"reading score"]

           test preparation course  reading score
math score
88                       completed             95
88                            none             89
88                            none             78
88                       completed             93
88                            none             73
88                            none             84
88                       completed             95
88                       completed             92
88                       completed             85
88                            none             75
88                       completed             99
88                            none             78
88                       completed             74
88                            none             77
88                       completed             99

In [121]:
# rows with indices 1,2,3
# columns with indices 1,2
df.iloc[1:4,:]

            gender race/ethnicity  ... reading score writing score
math score                         ...
69          female        group C  ...            90            88
90          female        group B  ...            95            93
47            male        group A  ...            57            44

[3 rows x 7 columns]

In [125]:
df.loc[:28,:]

            gender race/ethnicity  ... reading score writing score
math score                         ...
72          female        group B  ...            72            74
69          female        group C  ...            90            88
90          female        group B  ...            95            93
47            male        group A  ...            57            44
76            male        group C  ...            78            75
...            ...            ...  ...           ...           ...
43          female        group C  ...            53            53
41          female        group C  ...            46            43
82          female        group C  ...            90            94
61            male        group C  ...            61            62
28            male        group A  ...            23            19

[328 rows x 7 columns]

In [126]:
df.dtypes

gender                         object
race/ethnicity                 object
parental level of education    object
lunch                          object
test preparation course        object
reading score                   int64
writing score                   int64
dtype: object

In [127]:
df.dtypes == object

gender                          True
race/ethnicity                  True
parental level of education     True
lunch                           True
test preparation course         True
reading score                  False
writing score                  False
dtype: bool

In [128]:
df.loc[:,df.dtypes == object]

            gender race/ethnicity  ...         lunch test preparation course
math score                         ...
72          female        group B  ...      standard                    none
69          female        group C  ...      standard               completed
90          female        group B  ...      standard                    none
47            male        group A  ...  free/reduced                    none
76            male        group C  ...      standard                    none
...            ...            ...  ...           ...                     ...
88          female        group E  ...      standard               completed
62            male        group C  ...  free/reduced                    none
59          female        group C  ...  free/reduced               completed
68          female        group D  ...      standard               completed
77          female        group D  ...  free/reduced                    none

[1000 rows x 5 columns]

In [129]:
df.dtypes ==np.int64

gender                         False
race/ethnicity                 False
parental level of education    False
lunch                          False
test preparation course        False
reading score                   True
writing score                   True
dtype: bool

In [130]:
df.loc[:,df.dtypes == np.int64]

            reading score  writing score
math score
72                     72             74
69                     90             88
90                     95             93
47                     57             44
76                     78             75
...                   ...            ...
88                     99             95
62                     55             55
59                     71             65
68                     78             77
77                     86             86

[1000 rows x 2 columns]

In [140]:
df.lunch

math score
72        standard
69        standard
90        standard
47    free/reduced
76        standard
          ...
88        standard
62    free/reduced
59    free/reduced
68        standard
77    free/reduced
Name: lunch, Length: 1000, dtype: object

In [136]:
df.lunch.nunique()

2

In [137]:
df.lunch.unique()

array(['standard', 'free/reduced'], dtype=object)

In [141]:
df.lunch== 'standard'

math score
72     True
69     True
90     True
47    False
76     True
      ...
88     True
62    False
59    False
68     True
77    False
Name: lunch, Length: 1000, dtype: bool

In [143]:
df.loc[df. lunch== 'standard',:]

            gender race/ethnicity  ... reading score writing score
math score                         ...
72          female        group B  ...            72            74
69          female        group C  ...            90            88
90          female        group B  ...            95            93
76            male        group C  ...            78            75
71          female        group B  ...            83            78
...            ...            ...  ...           ...           ...
81            male        group E  ...            75            76
65          female        group B  ...            82            78
63            male        group A  ...            63            62
88          female        group E  ...            99            95
68          female        group D  ...            78            77

[645 rows x 7 columns]

In [147]:
#Access Multiple columns
df[['lunch','writing score','test preparation course']]

                   lunch  writing score test preparation course
math score
72              standard             74                    none
69              standard             88               completed
90              standard             93                    none
47          free/reduced             44                    none
76              standard             75                    none
...                  ...            ...                     ...
88              standard             95               completed
62          free/reduced             55                    none
59          free/reduced             65               completed
68              standard             77               completed
77          free/reduced             86                    none

[1000 rows x 3 columns]

In [149]:
df[['lunch']]

                   lunch
math score
72              standard
69              standard
90              standard
47          free/reduced
76              standard
...                  ...
88              standard
62          free/reduced
59          free/reduced
68              standard
77          free/reduced

[1000 rows x 1 columns]

In [151]:
df.iloc[120]

gender                                    female
race/ethnicity                           group C
parental level of education    bachelor's degree
lunch                                   standard
test preparation course                completed
reading score                                 92
writing score                                 89
Name: 79, dtype: object

In [153]:
df.iloc[[120]]

            gender race/ethnicity  ... reading score writing score
math score                         ...
79          female        group C  ...            92            89

[1 rows x 7 columns]

In [154]:
df.iloc[120:134]

            gender race/ethnicity  ... reading score writing score
math score                         ...
79          female        group C  ...            92            89
91            male        group B  ...            89            92
88          female        group C  ...            93            93
63            male        group D  ...            57            56
83            male        group E  ...            80            73
87          female        group B  ...            95            86
72            male        group B  ...            68            67
65            male        group D  ...            77            74
82            male        group D  ...            82            74
51          female        group A  ...            49            51
89            male        group D  ...            84            82
53            male        group C  ...            37            40
87            male        group E  ...            74            70
75          female        group C  ...            81            84

[14 rows x 7 columns]

In [161]:
df.lunch.isnull()

math score
72    False
69    False
90    False
47    False
76    False
      ...
88    False
62    False
59    False
68    False
77    False
Name: lunch, Length: 1000, dtype: bool

ERROR! Session/line number was not unique in database. History logging moved to new session 77

In [159]:
df.lunch.isna()

math score
72    False
69    False
90    False
47    False
76    False
      ...
88    False
62    False
59    False
68    False
77    False
Name: lunch, Length: 1000, dtype: bool

In [156]:
df.gender.isnull()

math score
72    False
69    False
90    False
47    False
76    False
      ...
88    False
62    False
59    False
68    False
77    False
Name: gender, Length: 1000, dtype: bool

ERROR! Session/line number was not unique in database. History logging moved to new session 75

In [165]:
df.gender.isna()

math score
72    False
69    False
90    False
47    False
76    False
      ...
88    False
62    False
59    False
68    False
77    False
Name: gender, Length: 1000, dtype: bool

In [169]:
df.isna().sum(axis=1)

math score
72    0
69    0
90    0
47    0
76    0
     ..
88    0
62    0
59    0
68    0
77    0
Length: 1000, dtype: int64

In [174]:
# To remove columns with labels salary and year
df.drop(["lunch",'reading score'],axis=1)

            gender race/ethnicity  ... test preparation course writing score
math score                         ...
72          female        group B  ...                    none            74
69          female        group C  ...               completed            88
90          female        group B  ...                    none            93
47            male        group A  ...                    none            44
76            male        group C  ...                    none            75
...            ...            ...  ...                     ...           ...
88          female        group E  ...               completed            95
62            male        group C  ...                    none            55
59          female        group C  ...               completed            65
68          female        group D  ...               completed            77
77          female        group D  ...                    none            86

[1000 rows x 5 columns]

In [178]:
# To remove columns with indices 1 and 2
df.drop(index = [78,90],axis=1)

            gender race/ethnicity  ... reading score writing score
math score                         ...
72          female        group B  ...            72            74
69          female        group C  ...            90            88
47            male        group A  ...            57            44
76            male        group C  ...            78            75
71          female        group B  ...            83            78
...            ...            ...  ...           ...           ...
88          female        group E  ...            99            95
62            male        group C  ...            55            55
59          female        group C  ...            71            65
68          female        group D  ...            78            77
77          female        group D  ...            86            86

[978 rows x 7 columns]

In [181]:
df

            gender race/ethnicity  ... reading score writing score
math score                         ...
72          female        group B  ...            72            74
69          female        group C  ...            90            88
90          female        group B  ...            95            93
47            male        group A  ...            57            44
76            male        group C  ...            78            75
...            ...            ...  ...           ...           ...
88          female        group E  ...            99            95
62            male        group C  ...            55            55
59          female        group C  ...            71            65
68          female        group D  ...            78            77
77          female        group D  ...            86            86

[1000 rows x 7 columns]

In [179]:
help(df.drop)

Help on method drop in module pandas.core.frame:

drop(labels=None, axis=0, index=None, columns=None, level=None, inplace=False, errors='raise') method of pandas.core.frame.DataFrame instance
    Drop specified labels from rows or columns.

    Remove rows or columns by specifying label names and corresponding
    axis, or by specifying directly index or column names. When using a
    multi-index, labels on different levels can be removed by specifying
    the level.

    Parameters
    ----------
    labels : single label or list-like
        Index or column labels to drop.
    axis : {0 or 'index', 1 or 'columns'}, default 0
        Whether to drop labels from the index (0 or 'index') or
        columns (1 or 'columns').
    index : single label or list-like
        Alternative to specifying axis (``labels, axis=0``
        is equivalent to ``index=labels``).

        .. versionadded:: 0.21.0
    columns : single label or list-like
        Alternative to specifying axis (``labels, axis=1``
        is equivalent to ``columns=labels``).

        .. versionadded:: 0.21.0
    level : int or level name, optional
        For MultiIndex, level from which the labels will be removed.
    inplace : bool, default False
        If True, do operation inplace and return None.
    errors : {'ignore', 'raise'}, default 'raise'
        If 'ignore', suppress error and only existing labels are
        dropped.

    Returns
    -------
    DataFrame
        DataFrame without the removed index or column labels.

    Raises
    ------
    KeyError
        If any of the labels is not found in the selected axis.

    See Also
    --------
    DataFrame.loc : Label-location based indexer for selection by label.
    DataFrame.dropna : Return DataFrame with labels on given axis omitted
        where (all or any) data are missing.
    DataFrame.drop_duplicates : Return DataFrame with duplicate rows
        removed, optionally only considering certain columns.
    Series.drop : Return Series with specified index labels removed.

    Examples
    --------
    >>> df = pd.DataFrame(np.arange(12).reshape(3, 4),
    ...                   columns=['A', 'B', 'C', 'D'])
    >>> df
       A  B   C   D
    0  0  1   2   3
    1  4  5   6   7
    2  8  9  10  11

    Drop columns

    >>> df.drop(['B', 'C'], axis=1)
       A   D
    0  0   3
    1  4   7
    2  8  11

    >>> df.drop(columns=['B', 'C'])
       A   D
    0  0   3
    1  4   7
    2  8  11

    Drop a row by index

    >>> df.drop([0, 1])
       A  B   C   D
    2  8  9  10  11

    Drop columns and/or rows of MultiIndex DataFrame

    >>> midx = pd.MultiIndex(levels=[['lama', 'cow', 'falcon'],
    ...                              ['speed', 'weight', 'length']],
    ...                      codes=[[0, 0, 0, 1, 1, 1, 2, 2, 2],
    ...                             [0, 1, 2, 0, 1, 2, 0, 1, 2]])
    >>> df = pd.DataFrame(index=midx, columns=['big', 'small'],
    ...                   data=[[45, 30], [200, 100], [1.5, 1], [30, 20],
    ...                         [250, 150], [1.5, 0.8], [320, 250],
    ...                         [1, 0.8], [0.3, 0.2]])
    >>> df
                    big     small
    lama    speed   45.0    30.0
            weight  200.0   100.0
            length  1.5     1.0
    cow     speed   30.0    20.0
            weight  250.0   150.0
            length  1.5     0.8
    falcon  speed   320.0   250.0
            weight  1.0     0.8
            length  0.3     0.2

    >>> df.drop(index='cow', columns='small')
                    big
    lama    speed   45.0
            weight  200.0
            length  1.5
    falcon  speed   320.0
            weight  1.0
            length  0.3

    >>> df.drop(index='length', level=1)
                    big     small
    lama    speed   45.0    30.0
            weight  200.0   100.0
    cow     speed   30.0    20.0
            weight  250.0   150.0
    falcon  speed   320.0   250.0
            weight  1.0     0.8

In [163]:
data.dropna()# Removes the rows where we have missing values

     gender race/ethnicity  ... reading score writing score
0    female        group B  ...            72            74
1    female        group C  ...            90            88
2    female        group B  ...            95            93
3      male        group A  ...            57            44
4      male        group C  ...            78            75
..      ...            ...  ...           ...           ...
995  female        group E  ...            99            95
996    male        group C  ...            55            55
997  female        group C  ...            71            65
998  female        group D  ...            78            77
999  female        group D  ...            86            86

[1000 rows x 8 columns]

In [183]:
df.dropna(axis=1) # Removes the columns where we have missing values

            gender race/ethnicity  ... reading score writing score
math score                         ...
72          female        group B  ...            72            74
69          female        group C  ...            90            88
90          female        group B  ...            95            93
47            male        group A  ...            57            44
76            male        group C  ...            78            75
...            ...            ...  ...           ...           ...
88          female        group E  ...            99            95
62            male        group C  ...            55            55
59          female        group C  ...            71            65
68          female        group D  ...            78            77
77          female        group D  ...            86            86

[1000 rows x 7 columns]

In [185]:
df.lunch.dropna()

math score
72        standard
69        standard
90        standard
47    free/reduced
76        standard
          ...
88        standard
62    free/reduced
59    free/reduced
68        standard
77    free/reduced
Name: lunch, Length: 1000, dtype: object

ERROR! Session/line number was not unique in database. History logging moved to new session 92

In [188]:
df.fillna(0)

            gender race/ethnicity  ... reading score writing score
math score                         ...
72          female        group B  ...            72            74
69          female        group C  ...            90            88
90          female        group B  ...            95            93
47            male        group A  ...            57            44
76            male        group C  ...            78            75
...            ...            ...  ...           ...           ...
88          female        group E  ...            99            95
62            male        group C  ...            55            55
59          female        group C  ...            71            65
68          female        group D  ...            78            77
77          female        group D  ...            86            86

[1000 rows x 7 columns]